docs/howtotest.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2018-10-27 Sat 07:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-mode 翻訳プロジェクト プレテスト</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Takaaki ISHIKAWA" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Org-mode 翻訳プロジェクト プレテスト</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org34bf31f">1. はじめに</a></li>
<li><a href="#orgbb11a37">2. プレテストの目的</a></li>
<li><a href="#orgeb60a24">3. 注意点（必ず読んでください！）</a>
<ul>
<li><a href="#orgb20c849">3.1. github ユーザ</a></li>
<li><a href="#org80783ce">3.2. po-mode ユーザ</a>
<ul>
<li><a href="#orgb69d6cf">3.2.1. 正しいヘッダ（翻訳日時と名前などは，通常，保存時に変更されます）</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org64f97a8">4. 作業手順（github アカウントがない人）</a>
<ul>
<li><a href="#orgb1126d0">4.1. 翻訳者用のメーリングリストに参加してください．</a></li>
<li><a href="#org2cb5cbf">4.2. メンテナーにチケット予約を依頼する</a></li>
<li><a href="#org65775ff">4.3. github から翻訳リソースをダウンロードする</a></li>
<li><a href="#orgfe36c26">4.4. ダウンロードファイルの中の org-jp.po を開く</a></li>
<li><a href="#orga550407">4.5. チケットで指定された訳文番号を探します．</a>
<ul>
<li><a href="#org7ae8f73">4.5.1. 例</a></li>
</ul>
</li>
<li><a href="#org3ea4f05">4.6. 翻訳します</a></li>
<li><a href="#org35cd5e5">4.7. データをチケット発行の代行をしたメンテナーに提出します．</a></li>
</ul>
</li>
<li><a href="#orgd5aee3c">5. 作業手順（github アカウントがある人）</a>
<ul>
<li><a href="#org881d5b5">5.1. @takaxp に org-mode-doc-ja への参加を依頼します．</a></li>
<li><a href="#orgf3c95ac">5.2. 発行済みチケットの担当を宣言します．</a></li>
<li><a href="#orgcbec7ec">5.3. リポジトリを入手します．</a></li>
<li><a href="#orgacd1b72">5.4. ダウンロードファイルの中の org-jp.po を開く</a></li>
<li><a href="#org7bff42a">5.5. チケットで指定された訳文番号を探します．</a></li>
<li><a href="#org82f7069">5.6. 翻訳します</a></li>
<li><a href="#org277d9d8">5.7. 翻訳データを登録します</a>
<ul>
<li><a href="#org2de3ff5">5.7.1. 翻訳データを登録します（コンフリクト経験が浅い方）</a></li>
<li><a href="#orged8ce9a">5.7.2. 翻訳データを登録します（自力で何とかできる方）</a></li>
</ul>
</li>
<li><a href="#org3dc94a0">5.8. github で登録した情報を確認します．</a>
<ul>
<li><a href="#orgdf57201">5.8.1. 登録ミスに気付いた場合</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
#+READONLY
</p>
<div id="outline-container-org34bf31f" class="outline-2">
<h2 id="org34bf31f"><span class="section-number-2">1</span> はじめに</h2>
<div class="outline-text-2" id="text-1">
<p>
Org-mode 翻訳プロジェクトは，全部で4000個を超える英文を日本語翻訳する必要があります．原文は，texinfo 形式で配布されていますが，今回の翻訳作業では，texinfo 形式を翻訳カタログに変換した po 形式のファイルを編集します．
</p>

<p>
po 形式のファイルは，
</p>
<ul class="org-ul">
<li>po-mode for Emacs (<a href="http://www.gnu.org/software/gettext/">http://www.gnu.org/software/gettext/</a>)</li>
<li>PoEdit (<a href="http://www.poedit.net/">http://www.poedit.net/</a>)</li>
</ul>
<p>
などのツールを利用して効率良く編集することができます．プレーンテキストとして編集することもできますが，ツールの利用を推奨します．
</p>

<p>
プレテストは，あらかじめ github というソースコード管理を行うリポジトリに登録されているチケットを担当することで，他の翻訳者との作業の重複を避けます．チケットで翻訳する英文を宣言し，翻訳結果を po 形式のファイルに書き込みます．翻訳が終了したら，翻訳済みの po 形式のファイルを，github のリポジトリに登録します．MLを使って提出することも可能です．
</p>

<p>
翻訳の結果の見栄えについては，特に気にせずに，ひたすら訳してください m(_ _)m
</p>
</div>
</div>

<div id="outline-container-orgbb11a37" class="outline-2">
<h2 id="orgbb11a37"><span class="section-number-2">2</span> プレテストの目的</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>github を利用した翻訳ワークフローのあら探し</li>
<li>コンフリクトがどのように生じるかの検証</li>
<li>INFO／PDFの自動生成を阻害する翻訳作業の特定</li>
<li>頻出用語の訳語決定</li>
<li>翻訳者がツールに慣れる機会を提供する</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb60a24" class="outline-2">
<h2 id="orgeb60a24"><span class="section-number-2">3</span> 注意点（必ず読んでください！）</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>UTF-8 を利用してください．</li>
</ul>
<p>
別のコードを使う場合は，github にコミットせず，MLに提出してください．
</p>
<ul class="org-ul">
<li>改行コードはLFにしてください．</li>
</ul>
<p>
別のコードを使う場合は，github にコミットせず，MLに提出してください．
</p>
<ul class="org-ul">
<li>対訳に半角スペースを入れないでください．</li>
<li>texinfo の制御文は残してください．</li>
</ul>
<p>
どれが制御文かはあえて明示しません．これは，INFO自動生成時に問題になる
ところを今回のプレテストで知るためです．ミスして訳しても全く問題ありません！
</p>
<ul class="org-ul">
<li>翻訳は，4.6版の訳を積極的に参照してください．</li>
</ul>
<p>
未公開のwikiで入手可能なので，#org2ja で聞いて下さい．
</p>
<ul class="org-ul">
<li>翻訳中に気付いたことは，担当チケットのコメント欄に記入してください．</li>
<li>基本は「ですます調」で訳してください．</li>
</ul>
<p>
ただし，「である調（〜する．〜と書く．など）」が相応しい場合（箇条書きの中やコマンドの説明など）には，翻訳者の判断で「である調」を使用してください．
</p>
</div>

<div id="outline-container-orgb20c849" class="outline-3">
<h3 id="orgb20c849"><span class="section-number-3">3.1</span> github ユーザ</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>翻訳プロジェクトに参加したら，すみやかに git clone でデータを取り寄せてください．</li>
</ul>
<p>
=&gt; ダウンロードによるデータの取り寄せは行わないでください．
</p>
<ul class="org-ul">
<li>git clone で入手した org-ja.po を編集（翻訳）してください．</li>
<li>git push（コミット）後は，github のウェブサイトで差分を確認してください．</li>
</ul>
</div>
</div>

<div id="outline-container-org80783ce" class="outline-3">
<h3 id="org80783ce"><span class="section-number-3">3.2</span> po-mode ユーザ</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>po ファイルを編集する時に，余計なヘッダが加わる場合があります．</li>
</ul>
<p>
コミットする前に必ず重複ヘッダを削除してください．
</p>
<ul class="org-ul">
<li>MacPorts で配布されている po-mode.el は，version2.1です．</li>
</ul>
<p>
gettext で配布される po-mode.el は，version2.2ですので，こちらを推奨します．
<a href="http://www.gnu.org/software/gettext/">http://www.gnu.org/software/gettext/</a>
</p>
</div>
<div id="outline-container-orgb69d6cf" class="outline-4">
<h4 id="orgb69d6cf"><span class="section-number-4">3.2.1</span> 正しいヘッダ（翻訳日時と名前などは，通常，保存時に変更されます）</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
@&lt;pre&gt;
</p>

<p>
	msgid ""
	msgstr ""
	"Project-Id-Version: org-ja\n"
	"POT-Creation-Date: 2011-04-20 21:27+0900\n"
	"PO-Revision-Date: 2011-04-24 18:19+0900\n"
	"Last-Translator: Takaaki ISHIKAWA &lt;takaxp@ieee.org&gt;\n"
	"Language-Team: org-mode-doc-ja &lt;org2ja-users@lists.sourceforge.net&gt;\n"
	"Language: \n"
	"MIME-Version: 1.0\n"
	"Content-Type: text/plain; charset=UTF-8\n"
	"Content-Transfer-Encoding: 8bit\n"
	"X-Poedit-Language: Japanese\n"
	"X-Poedit-Country: JAPAN\n"
	"X-Poedit-SourceCharset: utf-8\n"
	"X-Poedit-Basepath: .\n"
	"X-Poedit-SearchPath-0: .\n"
@&lt;/pre&gt;
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org64f97a8" class="outline-2">
<h2 id="org64f97a8"><span class="section-number-2">4</span> 作業手順（github アカウントがない人）</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb1126d0" class="outline-3">
<h3 id="orgb1126d0"><span class="section-number-3">4.1</span> 翻訳者用のメーリングリストに参加してください．</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>登録依頼を出すと，参加承認が下り次第連絡がいきます．</li>
</ul>
<p>
<a href="https://lists.sourceforge.net/lists/listinfo/org2ja-devel">https://lists.sourceforge.net/lists/listinfo/org2ja-devel</a>
にて登録を済ませてください．
</p>
</div>
</div>
<div id="outline-container-org2cb5cbf" class="outline-3">
<h3 id="org2cb5cbf"><span class="section-number-3">4.2</span> メンテナーにチケット予約を依頼する</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Twitter でハッシュタグ（#org2ja）を利用してツイートする．
=&gt; メンテナーは，すみやかに自分のアカウントでチケットを予約して，
=&gt; 翻訳者に報告する</li>
<li>合せてMLでも依頼するとより確実に伝わります．</li>
</ul>
<p>
24時間応答がない場合は，依頼のチェックミスがあったと考えられますので，再投稿をお願いします．	
</p>
</div>
</div>
<div id="outline-container-org65775ff" class="outline-3">
<h3 id="org65775ff"><span class="section-number-3">4.3</span> github から翻訳リソースをダウンロードする</h3>
<div class="outline-text-3" id="text-4-3">
<p>
次のサイトの画面右側に「Downloads」があります．
<a href="https://github.com/org-mode-doc-ja/org-ja">https://github.com/org-mode-doc-ja/org-ja</a>
</p>
</div>
</div>
<div id="outline-container-orgfe36c26" class="outline-3">
<h3 id="orgfe36c26"><span class="section-number-3">4.4</span> ダウンロードファイルの中の org-jp.po を開く</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>翻訳ツールの利用を推奨します．</li>
<li>通常のテキストエディタでもいけます</li>
</ul>
</div>
</div>
<div id="outline-container-orga550407" class="outline-3">
<h3 id="orga550407"><span class="section-number-3">4.5</span> チケットで指定された訳文番号を探します．</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>チケットで指定された訳文番号は，org-ja.po\<sub>words</sub>\<sub>1</sub>\<sub>512.txt</sub> の一列目に示されたインデックスと一致しています．</li>
<li>同じファイルの2列目は，org-ja.po の行数を表しています．</li>
</ul>
<p>
=&gt; 現段階（2011-04-25@01:40）で，2行の誤差が生じております．
=&gt; （2011-04-29@13:30）誤差は解消されました．
</p>
<ul class="org-ul">
<li>なお，3列目は原文における登場回数です．</li>
</ul>
</div>
<div id="outline-container-org7ae8f73" class="outline-4">
<h4 id="org7ae8f73"><span class="section-number-4">4.5.1</span> 例</h4>
<div class="outline-text-4" id="text-4-5-1">
<ul class="org-ul">
<li>preTR[ 40 - 60 ] という名前のチケット担当した場合，まずorg-ja.po\<sub>words</sub>\<sub>1</sub>\<sub>512.txt</sub> の一列目で対応するインデックスを探します．</li>
</ul>
<p>
@&lt;pre&gt;
38:	1143	2	The table editor has spreadsheet capabilities	
39:	1153	5	Org-Plot	
40:	1159	2	Plotting from org tables	
41:	1175	2	How to refer to another field or range	
42:	1192	2	Using Calc to compute stuff	
@&lt;/pre&gt;
</p>
<ul class="org-ul">
<li>インデックスが 40 に対応する org-ja.po 上の行数は，1159 とわかります．</li>
<li>org-ja.po を開いて 1159 行目に移動すれば，Plotting from org tables があります．</li>
</ul>
<p>
@&lt;pre&gt;
1151&gt; msgid "Org-Plot"
1152&gt; msgstr ""
1153&gt;
1154&gt; #. type: menuentry
1155&gt; #: org.texi:375
1156&gt; #: org.texi:1889
1157&gt; msgid "Plotting from org tables"
1158&gt; msgstr ""
1159&gt;
1160&gt; #. type: node
1161&gt; #: org.texi:386
@&lt;/pre&gt;
</p>
<ul class="org-ul">
<li>org-ja.po にある org.texi: 375 という数字は，原文の org.texi ファイルの行数に対応しています．原文の周囲の英文をチェックすれば，より正確に翻訳できるでしょう．</li>
<li>（注意）チケットで指定された翻訳対象用語は，必ずしも org-ja.po で連続して表示されるわけではありません．ご注意下さい．</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3ea4f05" class="outline-3">
<h3 id="org3ea4f05"><span class="section-number-3">4.6</span> 翻訳します</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>英語文は，msgid "hogehoge" と書かれているので，msgstr "ほげほげ" と</li>
</ul>
<p>
訳文を記入して保存します．
</p>
<ul class="org-ul">
<li>翻訳時には，このファイルに記載された「注意点」に気をつけてください．</li>
</ul>
</div>
</div>
<div id="outline-container-org35cd5e5" class="outline-3">
<h3 id="org35cd5e5"><span class="section-number-3">4.7</span> データをチケット発行の代行をしたメンテナーに提出します．</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li>MLに翻訳を終えた org-ja.po を提出します．</li>
<li>翻訳データは特に圧縮しなくてもMLに投げられるようになっています．</li>
<li>該当部分だけをメール本文にコピペしても構いません．</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd5aee3c" class="outline-2">
<h2 id="orgd5aee3c"><span class="section-number-2">5</span> 作業手順（github アカウントがある人）</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org881d5b5" class="outline-3">
<h3 id="org881d5b5"><span class="section-number-3">5.1</span> @takaxp に org-mode-doc-ja への参加を依頼します．</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>github のアカウントをDMなどで教えてください．</li>
<li>合せてMLにも参加してください．</li>
</ul>
<p>
<a href="https://lists.sourceforge.net/lists/listinfo/org2ja-devel">https://lists.sourceforge.net/lists/listinfo/org2ja-devel</a>
にて登録を済ませてください．
</p>
</div>
</div>
<div id="outline-container-orgf3c95ac" class="outline-3">
<h3 id="orgf3c95ac"><span class="section-number-3">5.2</span> 発行済みチケットの担当を宣言します．</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>githubのチケット一覧から，OPENかつ担当者がアサインされていないものを選びます．</li>
</ul>
<p>
preTR [501 - 520] のようなタイトルになっていますので，これをクリックするとチケットの詳細画面がでます．その中の右側で緑色の「OPEN」があれば，翻訳が完了していないチケットです．さらに，タイトル下に「No one is assigned」があれば，担当者がいません．
 =&gt; このプルダウンで，自分のアカウントを選択すれば担当完了です．
</p>

<p>
<a href="https://github.com/org-mode-doc-ja/org-ja/issues/">https://github.com/org-mode-doc-ja/org-ja/issues/</a>
</p>
</div>
</div>
<div id="outline-container-orgcbec7ec" class="outline-3">
<h3 id="orgcbec7ec"><span class="section-number-3">5.3</span> リポジトリを入手します．</h3>
<div class="outline-text-3" id="text-5-3">
<p>
git clone git@github.com:org-mode-doc-ja/org-ja.git
</p>
</div>
</div>
<div id="outline-container-orgacd1b72" class="outline-3">
<h3 id="orgacd1b72"><span class="section-number-3">5.4</span> ダウンロードファイルの中の org-jp.po を開く</h3>
<div class="outline-text-3" id="text-5-4">
<p>
=&gt;	作業手順（github アカウントがない人）と同じです．
</p>
</div>
</div>
<div id="outline-container-org7bff42a" class="outline-3">
<h3 id="org7bff42a"><span class="section-number-3">5.5</span> チケットで指定された訳文番号を探します．</h3>
<div class="outline-text-3" id="text-5-5">
<p>
=&gt;	作業手順（github アカウントがない人）と同じです．
</p>
</div>
</div>
<div id="outline-container-org82f7069" class="outline-3">
<h3 id="org82f7069"><span class="section-number-3">5.6</span> 翻訳します</h3>
<div class="outline-text-3" id="text-5-6">
<p>
=&gt;	作業手順（github アカウントがない人）と同じです．
</p>
</div>
</div>
<div id="outline-container-org277d9d8" class="outline-3">
<h3 id="org277d9d8"><span class="section-number-3">5.7</span> 翻訳データを登録します</h3>
<div class="outline-text-3" id="text-5-7">
</div>
<div id="outline-container-org2de3ff5" class="outline-4">
<h4 id="org2de3ff5"><span class="section-number-4">5.7.1</span> 翻訳データを登録します（コンフリクト経験が浅い方）</h4>
<div class="outline-text-4" id="text-5-7-1">
<p>
@&lt;pre&gt;
	 cp org-ja.po tmp/org-ja\<sub>usrname.po</sub>
	 git add tmp/org-ja\<sub>usrname.po</sub>
	 git commit -m 'ここにどの部分を編集したかのメッセージを書きます．'
	 git push
@&lt;/pre&gt;
</p>
</div>
</div>
<div id="outline-container-orged8ce9a" class="outline-4">
<h4 id="orged8ce9a"><span class="section-number-4">5.7.2</span> 翻訳データを登録します（自力で何とかできる方）</h4>
<div class="outline-text-4" id="text-5-7-2">
<p>
@&lt;pre&gt;
	 git add org-jp.po
	 git commit -m 'ここにどの部分を編集したかのメッセージを書きます．'
	 git push
@&lt;/pre&gt;
</p>
</div>
<ol class="org-ol">
<li><a id="orge5c8e71"></a>コンフリクトが発生した場合<br />
<div class="outline-text-5" id="text-5-7-2-1">
<ul class="org-ul">
<li>今回のテストでは，おそらくヘッダの日付部分でコンフリクトします．</li>
</ul>
<p>
コンフリクトを解消して，コミットし直してください．
</p>
<ul class="org-ul">
<li>よく解らないコンフリクトが発生した場合</li>
</ul>
<p>
github で新しいチケットを作り，twitter で報告してください．MLで報告してもかまいません．
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org3dc94a0" class="outline-3">
<h3 id="org3dc94a0"><span class="section-number-3">5.8</span> github で登録した情報を確認します．</h3>
<div class="outline-text-3" id="text-5-8">
<ul class="org-ul">
<li>情報を登録すると <a href="https://github.com/org-mode-doc-ja/org-ja">https://github.com/org-mode-doc-ja/org-ja</a> のトップページに</li>
</ul>
<p>
 自分が登録した情報に対応した commit / tree / parent の3つのリンクが表示されます．
=&gt; commit をクリックして移動するサイトで，差分を確認できるます．
=&gt; 翻訳した部分が正しく反映されているかを確認してください．
</p>
</div>
<div id="outline-container-orgdf57201" class="outline-4">
<h4 id="orgdf57201"><span class="section-number-4">5.8.1</span> 登録ミスに気付いた場合</h4>
<div class="outline-text-4" id="text-5-8-1">
<ul class="org-ul">
<li>自力で元に戻すかメンテナーに相談してください．</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Takaaki ISHIKAWA</p>
<p class="date">Created: 2018-10-27 Sat 07:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
